Дипломный_проект/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломный_проект/src/Documents/ВКМ_ГрафикОтпусков/Forms/ВКМ_АнализГрафика/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Адрес = ВладелецФормы.ВыгружаемТЧОтпускаСотрудников();
	ВКМ_ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес);
	
    ВКМ_Диаграмма.Очистить();
	ВКМ_Диаграмма.Обновление = Ложь;
	
	Для Каждого СтрокаТЧ Из ВКМ_ОтпускаСотрудников Цикл
		
	Точка = ВКМ_Диаграмма.УстановитьТочку(СтрокаТЧ.ВКМ_Сотрудник);
	Серия = ВКМ_Диаграмма.УстановитьСерию("Отпуск");
	Значение = ВКМ_Диаграмма.ПолучитьЗначение(Точка, Серия);
	
	ПериодДГ = Значение.Добавить();
	ПериодДГ.Начало = СтрокаТЧ.ВКМ_ДатаНачала;
	ПериодДГ.Конец = СтрокаТЧ.ВКМ_ДатаОкончания;
	
	КонецЦикла;
	ВКМ_Диаграмма.Обновление = Истина;
	
	
КонецПроцедуры
